bikeNomad/6800_Emulator/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Clock Control: 0x01u */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Control: 0x01u */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Control: 0x01u */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Clock Control: 0x01u */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Clock Control: 0x01u */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t MCU_NMI_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA0 (pin 79)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_NMI_GPIO, BOARD_INITPINS_MCU_NMI_PIN, &MCU_NMI_config);

    gpio_pin_config_t MCU_IRQ_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA6 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_IRQ_GPIO, BOARD_INITPINS_MCU_IRQ_PIN, &MCU_IRQ_config);

    gpio_pin_config_t MCU_E_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA8 (pin 100)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_E_GPIO, BOARD_INITPINS_MCU_E_PIN, &MCU_E_config);

    gpio_pin_config_t MCU_RESET_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA9 (pin 99)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_RESET_GPIO, BOARD_INITPINS_MCU_RESET_PIN, &MCU_RESET_config);

    gpio_pin_config_t MCU_D0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 54)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_D0_GPIO, BOARD_INITPINS_MCU_D0_PIN, &MCU_D0_config);

    gpio_pin_config_t MCU_D1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin 53)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_D1_GPIO, BOARD_INITPINS_MCU_D1_PIN, &MCU_D1_config);

    gpio_pin_config_t MCU_D2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 48)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_D2_GPIO, BOARD_INITPINS_MCU_D2_PIN, &MCU_D2_config);

    gpio_pin_config_t MCU_D3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 47)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_D3_GPIO, BOARD_INITPINS_MCU_D3_PIN, &MCU_D3_config);

    gpio_pin_config_t MCU_D4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB4 (pin 28)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_D4_GPIO, BOARD_INITPINS_MCU_D4_PIN, &MCU_D4_config);

    gpio_pin_config_t MCU_D5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB5 (pin 27)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_D5_GPIO, BOARD_INITPINS_MCU_D5_PIN, &MCU_D5_config);

    gpio_pin_config_t MCU_D6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB6 (pin 16)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_D6_GPIO, BOARD_INITPINS_MCU_D6_PIN, &MCU_D6_config);

    gpio_pin_config_t MCU_D7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB7 (pin 15)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_D7_GPIO, BOARD_INITPINS_MCU_D7_PIN, &MCU_D7_config);

    gpio_pin_config_t LED_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB15 (pin 65)  */
    GPIO_PinInit(BOARD_INITPINS_LED_2_GPIO, BOARD_INITPINS_LED_2_PIN, &LED_2_config);

    gpio_pin_config_t EX_4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 39)  */
    GPIO_PinInit(BOARD_INITPINS_EX_4_GPIO, BOARD_INITPINS_EX_4_PIN, &EX_4_config);

    gpio_pin_config_t EX_3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 30)  */
    GPIO_PinInit(BOARD_INITPINS_EX_3_GPIO, BOARD_INITPINS_EX_3_PIN, &EX_3_config);

    gpio_pin_config_t EX_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 29)  */
    GPIO_PinInit(BOARD_INITPINS_EX_2_GPIO, BOARD_INITPINS_EX_2_PIN, &EX_2_config);

    gpio_pin_config_t EX_8_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC15 (pin 45)  */
    GPIO_PinInit(BOARD_INITPINS_EX_8_GPIO, BOARD_INITPINS_EX_8_PIN, &EX_8_config);

    gpio_pin_config_t EX_7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC16 (pin 44)  */
    GPIO_PinInit(BOARD_INITPINS_EX_7_GPIO, BOARD_INITPINS_EX_7_PIN, &EX_7_config);

    gpio_pin_config_t EX_6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC17 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_EX_6_GPIO, BOARD_INITPINS_EX_6_PIN, &EX_6_config);

    gpio_pin_config_t MCU_A0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD0 (pin 4)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A0_GPIO, BOARD_INITPINS_MCU_A0_PIN, &MCU_A0_config);

    gpio_pin_config_t MCU_A1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD1 (pin 3)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A1_GPIO, BOARD_INITPINS_MCU_A1_PIN, &MCU_A1_config);

    gpio_pin_config_t MCU_A2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD2 (pin 71)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A2_GPIO, BOARD_INITPINS_MCU_A2_PIN, &MCU_A2_config);

    gpio_pin_config_t MCU_A3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD3 (pin 70)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A3_GPIO, BOARD_INITPINS_MCU_A3_PIN, &MCU_A3_config);

    gpio_pin_config_t MCU_A4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD4 (pin 69)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A4_GPIO, BOARD_INITPINS_MCU_A4_PIN, &MCU_A4_config);

    gpio_pin_config_t MCU_A5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD5 (pin 33)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A5_GPIO, BOARD_INITPINS_MCU_A5_PIN, &MCU_A5_config);

    gpio_pin_config_t MCU_A6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD6 (pin 32)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A6_GPIO, BOARD_INITPINS_MCU_A6_PIN, &MCU_A6_config);

    gpio_pin_config_t MCU_A7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD7 (pin 31)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A7_GPIO, BOARD_INITPINS_MCU_A7_PIN, &MCU_A7_config);

