bikeNomad/6800_Emulator/board/pin_mux.c
    gpio_pin_config_t MCU_A8_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD8 (pin 42)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A8_GPIO, BOARD_INITPINS_MCU_A8_PIN, &MCU_A8_config);

    gpio_pin_config_t MCU_A9_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD9 (pin 41)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A9_GPIO, BOARD_INITPINS_MCU_A9_PIN, &MCU_A9_config);

    gpio_pin_config_t MCU_A10_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD10 (pin 36)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A10_GPIO, BOARD_INITPINS_MCU_A10_PIN, &MCU_A10_config);

    gpio_pin_config_t MCU_A11_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD11 (pin 35)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A11_GPIO, BOARD_INITPINS_MCU_A11_PIN, &MCU_A11_config);

    gpio_pin_config_t MCU_A12_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD12 (pin 34)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A12_GPIO, BOARD_INITPINS_MCU_A12_PIN, &MCU_A12_config);

    gpio_pin_config_t MCU_A13_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD13 (pin 25)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A13_GPIO, BOARD_INITPINS_MCU_A13_PIN, &MCU_A13_config);

    gpio_pin_config_t MCU_A14_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD14 (pin 24)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A14_GPIO, BOARD_INITPINS_MCU_A14_PIN, &MCU_A14_config);

    gpio_pin_config_t MCU_A15_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD15 (pin 22)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A15_GPIO, BOARD_INITPINS_MCU_A15_PIN, &MCU_A15_config);

    gpio_pin_config_t MCU_VMA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD16 (pin 21)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_VMA_GPIO, BOARD_INITPINS_MCU_VMA_PIN, &MCU_VMA_config);

    gpio_pin_config_t MCU_RW_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD17 (pin 20)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_RW_GPIO, BOARD_INITPINS_MCU_RW_PIN, &MCU_RW_config);

    gpio_pin_config_t EX_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE8 (pin 26)  */
    GPIO_PinInit(BOARD_INITPINS_EX_1_GPIO, BOARD_INITPINS_EX_1_PIN, &EX_1_config);

    /* PORTA0 (pin 79) is configured as PTA0 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_NMI_PORT, BOARD_INITPINS_MCU_NMI_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA0 (pin 79): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_MCU_NMI_PORT, BOARD_INITPINS_MCU_NMI_PIN, kPORT_InterruptFallingEdge);

    /* PORTA1 (pin 78) is configured as LPUART0_RTS */
    PORT_SetPinMux(BOARD_INITPINS_UART0_RTS_PORT, BOARD_INITPINS_UART0_RTS_PIN, kPORT_MuxAlt6);

    /* PORTA10 (pin 92) is configured as noetm_Trace_SWO */
    PORT_SetPinMux(PORTA, 10U, kPORT_MuxAlt7);

    /* PORTA12 (pin 90) is configured as CAN1_RX */
    PORT_SetPinMux(BOARD_INITPINS_CAN1_RX_PORT, BOARD_INITPINS_CAN1_RX_PIN, kPORT_MuxAlt3);

    /* PORTA13 (pin 89) is configured as CAN1_TX */
    PORT_SetPinMux(BOARD_INITPINS_CAN1_TX_PORT, BOARD_INITPINS_CAN1_TX_PIN, kPORT_MuxAlt3);

    /* PORTA2 (pin 73) is configured as LPUART0_RX */
    PORT_SetPinMux(BOARD_INITPINS_UART0_RX_PORT, BOARD_INITPINS_UART0_RX_PIN, kPORT_MuxAlt6);

    /* PORTA3 (pin 72) is configured as LPUART0_TX */
    PORT_SetPinMux(BOARD_INITPINS_UART0_TX_PORT, BOARD_INITPINS_UART0_TX_PIN, kPORT_MuxAlt6);

    /* PORTA4 (pin 98) is configured as SWD_DIO */
    PORT_SetPinMux(PORTA, 4U, kPORT_MuxAlt7);

    /* PORTA5 (pin 97) is configured as RESET_b */
    PORT_SetPinMux(BOARD_INITPINS_NRESET_PORT, BOARD_INITPINS_NRESET_PIN, kPORT_MuxAlt7);

    /* PORTA6 (pin 58) is configured as PTA6 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_IRQ_PORT, BOARD_INITPINS_MCU_IRQ_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA6 (pin 58): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_MCU_IRQ_PORT, BOARD_INITPINS_MCU_IRQ_PIN, kPORT_InterruptFallingEdge);

    /* PORTA7 (pin 57) is configured as LPUART1_RTS */
    PORT_SetPinMux(BOARD_INITPINS_UART1_RTS_PORT, BOARD_INITPINS_UART1_RTS_PIN, kPORT_MuxAlt6);

    /* PORTA8 (pin 100) is configured as PTA8 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_E_PORT, BOARD_INITPINS_MCU_E_PIN, kPORT_MuxAsGpio);

    /* PORTA9 (pin 99) is configured as PTA9 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_RESET_PORT, BOARD_INITPINS_MCU_RESET_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 54) is configured as PTB0 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D0_PORT, BOARD_INITPINS_MCU_D0_PIN, kPORT_MuxAsGpio);

    /* PORTB1 (pin 53) is configured as PTB1 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D1_PORT, BOARD_INITPINS_MCU_D1_PIN, kPORT_MuxAsGpio);

    /* PORTB14 (pin 66) is configured as LPSPI1_SCK */
    PORT_SetPinMux(PORTB, 14U, kPORT_MuxAlt3);

    /* PORTB15 (pin 65) is configured as PTB15 */
    PORT_SetPinMux(BOARD_INITPINS_LED_2_PORT, BOARD_INITPINS_LED_2_PIN, kPORT_MuxAsGpio);

    /* PORTB16 (pin 64) is configured as LPSPI1_SOUT */
    PORT_SetPinMux(PORTB, 16U, kPORT_MuxAlt3);

    /* PORTB17 (pin 63) is configured as LPSPI1_PCS3 */
    PORT_SetPinMux(PORTB, 17U, kPORT_MuxAlt3);

    /* PORTB2 (pin 48) is configured as PTB2 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D2_PORT, BOARD_INITPINS_MCU_D2_PIN, kPORT_MuxAsGpio);

    /* PORTB3 (pin 47) is configured as PTB3 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D3_PORT, BOARD_INITPINS_MCU_D3_PIN, kPORT_MuxAsGpio);

    /* PORTB4 (pin 28) is configured as PTB4 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D4_PORT, BOARD_INITPINS_MCU_D4_PIN, kPORT_MuxAsGpio);

