bikeNomad/6800_Emulator/board/pin_mux.c
    /* PORTB5 (pin 27) is configured as PTB5 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D5_PORT, BOARD_INITPINS_MCU_D5_PIN, kPORT_MuxAsGpio);

    /* PORTB6 (pin 16) is configured as PTB6 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D6_PORT, BOARD_INITPINS_MCU_D6_PIN, kPORT_MuxAsGpio);

    /* PORTB7 (pin 15) is configured as PTB7 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D7_PORT, BOARD_INITPINS_MCU_D7_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 40) is configured as FTM0_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_EX_5_PORT, BOARD_INITPINS_EX_5_PIN, kPORT_MuxAlt2);

    /* PORTC1 (pin 39) is configured as PTC1 */
    PORT_SetPinMux(BOARD_INITPINS_EX_4_PORT, BOARD_INITPINS_EX_4_PIN, kPORT_MuxAsGpio);

    /* PORTC15 (pin 45) is configured as PTC15 */
    PORT_SetPinMux(BOARD_INITPINS_EX_8_PORT, BOARD_INITPINS_EX_8_PIN, kPORT_MuxAsGpio);

    /* PORTC16 (pin 44) is configured as PTC16 */
    PORT_SetPinMux(BOARD_INITPINS_EX_7_PORT, BOARD_INITPINS_EX_7_PIN, kPORT_MuxAsGpio);

    /* PORTC17 (pin 43) is configured as PTC17 */
    PORT_SetPinMux(BOARD_INITPINS_EX_6_PORT, BOARD_INITPINS_EX_6_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 30) is configured as PTC2 */
    PORT_SetPinMux(BOARD_INITPINS_EX_3_PORT, BOARD_INITPINS_EX_3_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin 29) is configured as PTC3 */
    PORT_SetPinMux(BOARD_INITPINS_EX_2_PORT, BOARD_INITPINS_EX_2_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 96) is configured as SWD_CLK */
    PORT_SetPinMux(PORTC, 4U, kPORT_MuxAlt7);

    /* PORTC6 (pin 81) is configured as LPUART1_RX */
    PORT_SetPinMux(BOARD_INITPINS_UART1_RX_PORT, BOARD_INITPINS_UART1_RX_PIN, kPORT_MuxAlt2);

    /* PORTC7 (pin 80) is configured as LPUART1_TX */
    PORT_SetPinMux(BOARD_INITPINS_UART1_TX_PORT, BOARD_INITPINS_UART1_TX_PIN, kPORT_MuxAlt2);

    /* PORTD0 (pin 4) is configured as PTD0 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A0_PORT, BOARD_INITPINS_MCU_A0_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[0] = ((PORTD->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Drive Strength Enable: Low drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_LowDriveStrength));

    /* PORTD1 (pin 3) is configured as PTD1 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A1_PORT, BOARD_INITPINS_MCU_A1_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[1] = ((PORTD->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Drive Strength Enable: Low drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_LowDriveStrength));

    /* PORTD10 (pin 36) is configured as PTD10 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A10_PORT, BOARD_INITPINS_MCU_A10_PIN, kPORT_MuxAsGpio);

    /* PORTD11 (pin 35) is configured as PTD11 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A11_PORT, BOARD_INITPINS_MCU_A11_PIN, kPORT_MuxAsGpio);

    /* PORTD12 (pin 34) is configured as PTD12 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A12_PORT, BOARD_INITPINS_MCU_A12_PIN, kPORT_MuxAsGpio);

    /* PORTD13 (pin 25) is configured as PTD13 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A13_PORT, BOARD_INITPINS_MCU_A13_PIN, kPORT_MuxAsGpio);

    /* PORTD14 (pin 24) is configured as PTD14 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A14_PORT, BOARD_INITPINS_MCU_A14_PIN, kPORT_MuxAsGpio);

    /* PORTD15 (pin 22) is configured as PTD15 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A15_PORT, BOARD_INITPINS_MCU_A15_PIN, kPORT_MuxAsGpio);

    /* PORTD16 (pin 21) is configured as PTD16 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_VMA_PORT, BOARD_INITPINS_MCU_VMA_PIN, kPORT_MuxAsGpio);

    /* PORTD17 (pin 20) is configured as PTD17 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_RW_PORT, BOARD_INITPINS_MCU_RW_PIN, kPORT_MuxAsGpio);

    /* PORTD2 (pin 71) is configured as PTD2 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A2_PORT, BOARD_INITPINS_MCU_A2_PIN, kPORT_MuxAsGpio);

    /* PORTD3 (pin 70) is configured as PTD3 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A3_PORT, BOARD_INITPINS_MCU_A3_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[3] = ((PORTD->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown));

    /* PORTD4 (pin 69) is configured as PTD4 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A4_PORT, BOARD_INITPINS_MCU_A4_PIN, kPORT_MuxAsGpio);

    /* PORTD5 (pin 33) is configured as PTD5 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A5_PORT, BOARD_INITPINS_MCU_A5_PIN, kPORT_MuxAsGpio);

    /* PORTD6 (pin 32) is configured as PTD6 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A6_PORT, BOARD_INITPINS_MCU_A6_PIN, kPORT_MuxAsGpio);

    /* PORTD7 (pin 31) is configured as PTD7 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A7_PORT, BOARD_INITPINS_MCU_A7_PIN, kPORT_MuxAsGpio);

    /* PORTD8 (pin 42) is configured as PTD8 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A8_PORT, BOARD_INITPINS_MCU_A8_PIN, kPORT_MuxAsGpio);

    /* PORTD9 (pin 41) is configured as PTD9 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A9_PORT, BOARD_INITPINS_MCU_A9_PIN, kPORT_MuxAsGpio);

    /* PORTE4 (pin 9) is configured as CAN0_RX */
    PORT_SetPinMux(BOARD_INITPINS_CAN0_RX_PORT, BOARD_INITPINS_CAN0_RX_PIN, kPORT_MuxAlt5);

    /* PORTE5 (pin 8) is configured as CAN0_TX */
    PORT_SetPinMux(BOARD_INITPINS_CAN0_TX_PORT, BOARD_INITPINS_CAN0_TX_PIN, kPORT_MuxAlt5);

    /* PORTE8 (pin 26) is configured as PTE8 */
    PORT_SetPinMux(BOARD_INITPINS_EX_1_PORT, BOARD_INITPINS_EX_1_PIN, kPORT_MuxAsGpio);

    /* PORTE9 (pin 23) is configured as DAC0_OUT */
    PORT_SetPinMux(BOARD_INITPINS_DAC_OUT_PORT, BOARD_INITPINS_DAC_OUT_PIN, kPORT_PinDisabledOrAnalog);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
